var data = {
  uirou: `拙者親方と申すは、お立ち会いの中に、
御存知のお方も御座りましょうが、
御江戸を発って二十里上方、
相州小田原一色町をお過ぎなされて、
青物町を登りへおいでなさるれば、
欄干橋虎屋藤衛門、
只今は剃髪致して、円斎となのりまする。
元朝より大晦日まで、
お手に入れまする此の薬は、
昔ちんの国の唐人、
外郎という人、我が朝へ来たり、
帝へ参内の折から、
この薬を深く籠め置き、用ゆる時は一粒ずつ、
冠のすき間より取り出す。
依ってその名を帝より、
とうちんこうと賜る。
即ち文字には、
「頂き、透く、香い」と書いて
「とうちんこう」と申す。
只今はこの薬、
殊の外世上に弘まり、方々に似看板を出し、
イヤ、小田原の、灰俵の、さん俵の、炭俵のと、
色々に申せども、
平仮名をもって「ういろう」と記せしは、
親方円斎ばかり。
もしやお立ち会いの中に、熱海か塔ノ沢へ湯治にお出でなさるるか、
又は伊勢参宮の折からは、必ず門違いなされまするな。
お登りならば右の方、お下りなれば左側、
八方が八棟、表が三棟玉堂造り、
破風には菊に桐のとうの御紋を御赦免あって、
系図正しき薬でござる。
イヤ最前より家名の自慢ばかりを申しても、
御存知ない方には、正身の胡椒の丸呑み、白河夜船、
さらば一粒食べかけて、
その気見合いをお目にかけましょう。
先ずこの薬をかように一粒舌の上にのせまして、
腹内へ納めますると、
イヤどうも云えぬは、胃、心、肺、肝がすこやかになりて、
薫風喉より来たり、口中微涼を生ずるが如し、
魚鳥、茸、麺類の食合わせ、其の他、万病速効ある事神の如し。
さて、この薬、第一の奇妙には、
舌のまわることが、銭ゴマがはだしで逃げる。
ひょっとしたがまわり出すと、矢も盾もたまらぬじゃ。
そりゃそら、そらそりゃ、まわってきたわ、まわってくるわ。
アワヤ咽、さたらな舌にカ牙サ歯音、
ハマの二つは唇の軽重、開合さわやかに、
あかさたなはまやらわ、おこそとのほもよろを、
一つへぎへぎに、へぎほしはじかみ、
盆まめ、盆米、盆ごぼう、摘立、摘豆、つみ山椒、
書写山の社僧正、
粉米のなまがみ、粉米のなまがみ、こん粉米の小生がみ、
繻子ひじゅす、繻子、繻珍、
親も嘉兵衛、子も嘉兵衛、親かへい子かへい、子かへい親かへい、
古栗の木の古切口。
雨合羽か、番合羽か、貴様のきゃはんも皮脚絆、我等がきゃはんも皮脚絆、
しっかわ袴のしっぽころびを、三針はりなかにちょと縫うて、ぬうてちょとぶんだせ、
かわら撫子、野石竹。
のら如来、のら如来、三のら如来に六のら如来。
一寸先のお小仏におけつまずきゃるな、細溝にどじょにょろり。
京のなま鱈奈良なま学鰹、ちょと四、五貫目、
お茶立ちょ、茶立ちょ、ちゃっと立ちょ、茶立ちょ、
青竹茶せんでお茶ちゃと立ちゃ。
来るは来るは何が来る、高野の山のおこけら小僧。
狸百匹、箸百膳、天目百杯、棒八百本。
武具、馬具、ぶぐ、ばぐ、三ぶぐばぐ、合わせて武具、馬具、六ぶぐばぐ。
菊、栗、きく、くり、三菊栗、合わせて菊栗六菊栗、
麦、ごみ、むぎ、ごみ、三むぎごみ、合わせてむぎ、ごみ、六むぎごみ。
あの長押の長薙刀は、誰が長薙刀ぞ。
向こうの胡麻がらは、えのごまがらか、あれこそほんの真胡麻殻。
がらぴい、がらぴい風車、
おきゃがれこぼし、おきゃがれ小坊師、ゆんべもこぼして又こぼした。
たあぷぽぽ、たあぷぽぽ、ちりから、ちりから、つったっぽ、
たっぽたっぽの一丁だこ、
落ちたら煮て食お、煮ても焼いても食われぬものは、
五徳、鉄きゅう、かな熊童子に、石熊、石持、虎熊、虎きす、
中にも、東寺の羅生門には、茨城童子がうで栗五合つかんでおむしゃる、
かの頼光のひざもと去らず。
鮒、きんかん、椎茸、定めて後段な、そば切り、そうめん、
うどんか、愚鈍な子新発地。
小棚の、小下の、小桶に、こ味噌が、こ有るぞ、
小杓子、こ持って、こすくって、こよこせ、おっと合点だ、
心得たんぼの川崎、神奈川、程ヶ谷、戸塚は、走って行けば、
やいとを摺りむく、三里ばかりか、藤沢、平塚、大磯がしや、
小磯の宿を七つ起きして、
早天早々、相州小田原とうちん香、
隠れござらぬ貴賤群衆の花のお江戸の花ういろう。
あれあの花を見てお心をおやわらぎやという。
産子、這子に至るまで、
この外郎のご評判、ご存じないとは申されまいまいつぶり、
角出せ、棒出せ、ぼうぼうまゆに、臼、杵、すりばち、ばちばちぐわらぐわらぐわらと、
羽目をはずして今日お出でのいずれも様に、
上げねばならぬ、売らねばならぬと息せい引っぱり、
東方世界の薬の元締め、薬師如来も照覧あれと、
ホホ敬って、ういろうは、いらっしゃりませぬか。`,
  title: 'Sample-text-generator',
  substr: '',
  length: '',
};

new Vue({
  el: '#app',
  data: data,
  methods: {
    showText: function() {
      this.substr = '';
      this.substr = this.uirou.replace(/\s+/g, "").substr(0, this.length);
    }
  }
});
